[
  {
    "type": "bug",
    "priority": "medium",
    "components": [
      "timeline/GanttChartSidebar",
      "schedule/DailyScheduleView"
    ],
    "title": "The sidebar doesn't update after logging work",
    "description": "It requires a window reload in order to update. By side bar, I mean the WorkStatusWidget. It requires manual reload. I would change the component, but that's lacking in the edit capabilities of feedback right now",
    "timestamp": "2025-08-19T22:44:32.477Z",
    "sessionId": "session-1755643472468-w6o7rucnp"
  },
  {
    "type": "improvement",
    "priority": "high",
    "components": [
      "work-logger/WorkLoggerDualView"
    ],
    "title": "Option to hide completed tasks in the timeline view in the dual view work logger",
    "description": "It gets way too crowded in the work logger view and I need to be able to filter down tasks. We can start by adding a filter for completed tasks. ",
    "context": "We should probably lay the groundwork for a full featured filtering system. ",
    "timestamp": "2025-08-19T22:42:25.828Z",
    "sessionId": "session-1755643345818-jk9nk362t",
    "resolved": true
  },
  {
    "type": "bug",
    "priority": "high",
    "components": [
      "timeline/GanttChart"
    ],
    "title": "Personal Task not displayed",
    "description": "I made a personal task called 'Task Management app' or something similar, and it is not displayed on the chart (it doesn't have a row)\n\nUPDATE: I can't get this task to show up on the timeline or be scheduled no matter what. Even if I open up a 6hr personal block tomorrow, nothing. If I open a 6hr focus block tomorrow, nothing either. There's something very wrong here. We should limit our tasktype enums to only those that the scheduler can handle. I actually think we turned off a lint check for unused enum values, we should turn it back on. ",
    "timestamp": "2025-08-19T22:39:52.093Z",
    "sessionId": "session-1755643192084-t2lth9jne"
  },
  {
    "type": "bug",
    "priority": "medium",
    "components": [
      "dev/DevTools"
    ],
    "title": "Feedback View Feature Duplicates",
    "description": "Each feedback item has 3 entries instead of 1, when I try to select one of them, all 3 are selected. Also, we should add the ability to update the feedback text for incomplete tasks. I.e. a feedback item complains about 2 bugs: bug 1 and bug 2, i should be able to change the text so that it only references bug 2 if bug 1 has been fixed. This is easier than completing and making a new one. Also, the prioirty field on the feedback form, even though it is autofilled by default with medium, doesn't recognize that priority has been filled out until you click a priority radio button. ",
    "timestamp": "2025-08-19T22:39:01.841Z",
    "sessionId": "session-1755643141834-t0y45odbl",
    "resolved": true
  },
  {
    "type": "improvement",
    "priority": "low",
    "components": [
      "work-logger/WorkLoggerDualView"
    ],
    "title": "\"Now\" Marker on Timeline View",
    "description": "it would be helpful to have a marker for the current time on the dual view timeline view, similar to how we have it for the Gantt chart",
    "timestamp": "2025-08-19T22:28:17.517Z",
    "sessionId": "session-1755642497501-69xszpmlm",
    "resolved": true
  },
  {
    "type": "improvement",
    "priority": "medium",
    "components": [
      "timeline/GanttChart"
    ],
    "title": "Duplicated Row in Gantt Chart from Dual View Feature Work",
    "description": "When we fixed the bug in the dual view, I think we introduced weird behavior in the Gantt Chart. Now there's a row for meetings, and a row for 'blocked time.' I actually kinda like this though, but the blocked time row should show everything from all rows merged into a single timeline. We still need the row for meetings. But I stored personal time slots like 'sleep' and 'breakfast' and 'exercise' as meetings so that might be why it's just a copy. \n\nThis has been fixed-ish, but I said I wanted a row that showed everything. The implementation for this feedback just deleted the row entirely. ",
    "timestamp": "2025-08-19T22:19:25.681Z",
    "sessionId": "session-1755641965656-t4sbx5sfw"
  },
  {
    "type": "bug",
    "priority": "low",
    "components": [
      "work-logger/WorkLoggerDualView"
    ],
    "title": "The intervals in the Gantt chart dual view overlap and truncate to an hour",
    "description": "The intervals in the Gantt chart dual view overlap and truncate to an hour. We also need to display some text for the meetings, and/or provide a tooltip. It's hard to verify it's correct because I can't see what meetings are taking up timeslots. ",
    "steps": "1. make meetings\n2. click on work logger dual view icon\n3. look at row called \"meetings\"",
    "expected": "Tooltip, not truncated to 1 hour intervals (show actual duration), and no overlap. ",
    "timestamp": "2025-08-19T22:16:57.141Z",
    "sessionId": "session-1755641817124-rfyz5oeo0",
    "resolved": true
  },
  {
    "type": "bug",
    "priority": "medium",
    "components": [
      "work-logger/WorkLoggerDualView"
    ],
    "title": "Time blocks overlap in the chart but not clock",
    "description": "In the clock, the arcs i see are aligned, but in the gantt chart style timeline view, they overlap",
    "timestamp": "2025-08-19T20:56:41.954Z",
    "sessionId": "session-1755637001929-nipnnn0ox",
    "resolved": true
  },
  {
    "type": "feature",
    "priority": "high",
    "title": "Need to see meetings on gantt chart view",
    "description": "Must have meetings visually to fill out logged time. Should also probably display total meeting time on sidebar, which should probably be listed as a component on the feedback form as well, unless that's what daily schedule view is.\n\nMostly fixed, but we need to display total meeting time on the sidebar, like where I see the \"Today's Planned Capacity\" currently. ",
    "components": [
      "work-logger/WorkLoggerDualView",
      "other"
    ],
    "timestamp": "2025-08-19T20:29:16.104Z",
    "sessionId": "session-1755635356105-lehziv12g",
    "resolved": true
  },
  {
    "type": "feature",
    "priority": "high",
    "components": [
      "utils/flexible-scheduler"
    ],
    "title": "Allow splitting of tasks to schedule tasks with long durations",
    "description": "If a task has like a 6 hour duration, but there are no 6 hour work blocks, I think it will never get scheduled. ",
    "timestamp": "2025-08-19T23:42:29.727Z",
    "sessionId": "session-1755646949723-ucei39mub"
  },
  {
    "type": "bug",
    "priority": "critical",
    "components": [
      "utils/flexible-scheduler"
    ],
    "title": "Issues with scheduling dependent tasks",
    "description": "Seeing scheduling issues when I certainly have enough blocks. Seems like the timeline may be not adjusting and leaving things in the past, which need to be done in order for other tasks to get scheduled. 53 empty time block(s) detected in schedule\n6660 minutes of focus time unused while focus tasks remain unscheduled\nUnscheduled Items (4)\nTask\nType\nDuration\nReason\n[ROI Implementation] Verify baby workflow results\nworkflow-step\n60 min\nMissing dependency - one or more dependencies do not exist\n[Safety Certification Task (Monday Deadline)] Get overview of sessions without distance extension\nworkflow-step\n45 min\nMissing dependency - one or more dependencies do not exist\n[Safety Certification Task (Monday Deadline)] Get approvals for CL\nworkflow-step\n30 min\nMissing dependency - one or more dependencies do not exist\nPersonal Task Management App\nfocused\n300 min\nRan out of available days or capacity\nBlock Utilization\nDate\nBlock\nTime\nFocus\nAdmin\nPersonal\nStatus\n2025-08-19\nd803e400-ca9f-454b-98d5-b169d9e3ba27\n5:30:00 AM - 9:00:00 AM\n0/160\n0/50\n-\nEmpty block: 210 minutes available but unused\n2025-08-19\n23defe6a-57d8-4a73-a21a-cad213a2cd76\n9:00:00 AM - 10:30:00 AM\n0/45\n0/45\n-\nEmpty block: 90 minutes available but unused\n2025-08-19\nd0fb5423-6a19-45bb-a289-e9edc7b32934\n11:00:00 AM - 12:00:00 PM\n0/30\n0/30\n-\nEmpty block: 6\n\nThis is the debug output. ",
    "context": "The data responsbile for this should be in the database still. Issue noticed at 8/19 at 4:45 PM PDT",
    "expected": "All tasks should be scheduled, even if it's weeks in advance. ",
    "actual": "Tasks are not being scheduled, and dependency resolutions are not achieved. ",
    "timestamp": "2025-08-19T23:45:42.119Z",
    "sessionId": "session-1755647142109-djuqis9w9",
    "resolved": true
  },
  {
    "type": "improvement",
    "priority": "medium",
    "components": [
      "work-logger/WorkLoggerDualView"
    ],
    "title": "Circadian rhythm should be user specified",
    "description": "I go to sleep at like 9 pm, so my circadian second peak is actually at 5 pm ish, where it says I will be at low energy right now! So we need to be able to specify the bedtime or at least read it from the sleep blocks or something. ",
    "timestamp": "2025-08-20T00:00:16.036Z",
    "sessionId": "session-1755648016025-m43qdwamm"
  },
  {
    "type": "bug",
    "priority": "low",
    "components": [
      "other"
    ],
    "title": "Y axis of eisenhower matrix interferes with rendered text",
    "description": "It's too far to the right, overlapping the first two blocks (column). Is this component even in the feedback affected components list?",
    "timestamp": "2025-08-20T00:12:00.160Z",
    "sessionId": "session-1755648720152-smzzn95hp"
  },
  {
    "type": "feature",
    "priority": "high",
    "components": [
      "utils/flexible-scheduler",
      "tasks/SequencedTaskEdit"
    ],
    "title": "Allow priority rankings on individual workflow steps",
    "description": "Sometimes, it's important to get one step of a workflow done, even if the entire thing is lower priority. It would be nice to be able to specify priorities for workflow steps as an optional parameter",
    "timestamp": "2025-08-20T14:31:52.487Z",
    "sessionId": "session-1755700312479-b1lostq8e"
  },
  {
    "type": "improvement",
    "priority": "low",
    "components": [
      "tasks/SequencedTaskEdit"
    ],
    "title": "Nodes in graph view are not spaced out enough",
    "description": "Nodes in graph view seem to touch sometimes, and this makes it hard to see the actual dependencies. ",
    "timestamp": "2025-08-20T14:36:10.752Z",
    "sessionId": "session-1755700570743-xmdghxk49"
  },
  {
    "type": "bug",
    "priority": "high",
    "components": [
      "ai/BrainstormModal"
    ],
    "title": "Jargon dictionary error",
    "description": "I'm not convinced the Jargon dictionary works well or is persistent/editable across different brainstorming sessions. I also notice an error in the console about saving jargon: [2025-08-20T14:39:54.022Z] [AI] Error updating jargon definition: Objecterror: \"window.electronAPI.db.updateJargonDefinition is not a function\"stack: \"TypeError: window.electronAPI.db.updateJargonDefinition is not a function\\n    at td.updateJargonDefinition (http://localhost:5174/assets/index-Dsx14iLZ.js:69:672922)\\n    at Object.onBlur (http://localhost:5174/assets/index-Dsx14iLZ.js:99:5517)\\n    at Object.onBlur (http://localhost:5174/assets/index-Dsx14iLZ.js:68:18552)\\n    at onBlur (http://localhost:5174/assets/index-Dsx14iLZ.js:68:13494)\\n    at S3 (http://localhost:5174/assets/index-Dsx14iLZ.js:48:118615)\\n    at http://localhost:5174/assets/index-Dsx14iLZ.js:48:123927\\n    at Ms (http://localhost:5174/assets/index-Dsx14iLZ.js:48:9049)\\n    at _1 (http://localhost:5174/assets/index-Dsx14iLZ.js:48:119866)\\n    at F1 (http://localhost:5174/assets/index-Dsx14iLZ.js:49:26920)\\n    at u$ (http://localhost:5174/assets/index-Dsx14iLZ.js:49:26742)\"[[Prototype]]: Object",
    "steps": "open brainstorm, add context, try to fill in jargon terms",
    "timestamp": "2025-08-20T14:48:20.865Z",
    "sessionId": "session-1755701300855-7fq3y411o"
  },
  {
    "type": "feature",
    "priority": "high",
    "components": [
      "ai/BrainstormModal"
    ],
    "title": "Better AI Brainstorm Editing and Feedback",
    "description": "Basically, I want the AI brainstorm to be more interactive like I noticed that the AI puts notes out where it says need more clarification on X. But from what I understand there's no way to actually give it more clarification except for canceling the entire brainstorming session and then restarting with the same prompt. I think there's like an option for like try again or something I have some of the same issues with the amendment applicator I think that the ideal workflow would be to see what the AI suggest and then have like a text box underneath it's \"\" notes so that a user can input notes immediately to answer the questions and then have Claude redo the workflow generation just for that one item and then another thing I noticed was I would really like to be able to edit priorities and durations on that same AI brainstorm menu before I click accept. And for the amendment applicator I think few things first is that I need to be able to like use the application and scroll through it in order to like check on the current state and scroll through current workflow so I can say OK this one needs to be changed. But the issue is that it tries to apply to like all of the workflow and then if it gets it wrong, it just says do you wanna try again and you have to like restart from scratch and it doesn't even really save your voice memo or allow you to text edit it basically this is supposed to be unease of use feature to make things easier and I feel like it actually makes things take a little bit longer would be more tedious sometimes. Additionally, I was thinking it would be nice if I could like open up an AI chat window and actually talk to Claude but kind of with the same framework where it has to output like workflows and and stuff and maybe we could integrate like a chat into like what is already existin and that way whatever Claude responds with it's like displayed as a workflow.",
    "timestamp": "2025-08-20T14:52:27.379Z",
    "sessionId": "session-1755701547369-y5cktp5zo"
  },
  {
    "type": "improvement",
    "priority": "high",
    "components": [
      "tasks/SequencedTaskEdit"
    ],
    "title": "Should not have 2 edit buttons to edit a workflow",
    "description": "I have to click two edit buttons to actually get to a page to edit the workflows. ",
    "timestamp": "2025-08-20T14:53:19.542Z",
    "sessionId": "session-1755701599536-zu8umszf4"
  },
  {
    "type": "bug",
    "priority": "high",
    "components": [
      "work-logger/WorkLoggerDualView",
      "progress/WorkflowProgressTracker",
      "tasks/SequencedTaskEdit"
    ],
    "title": "Time logged in the dual view work logger component not shown in workflow progress tracker",
    "description": "I logged time in the dual view on a task, and then when I went to the workflow progress tracker and workflow editor pages, I saw there was no time logged on the task I logged it for. ",
    "timestamp": "2025-08-20T15:48:25.110Z",
    "sessionId": "session-1755704905099-o0cnx1czi"
  }
]